# Напишите программу, которая считывает два целых числа 𝑎 и 𝑏 и выводит на экран квадрат суммы

a, b = int(input()), int(input())

print("Квадрат суммы", a, "и", b, "равен", (a+b)**2)
print("Сумма квадратов", a, "и", b, "равна", a**2 + b**2)