# Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):

# *
# **
# ***
# ****
# *****
# ******
# *******

for i in range(1, 8):
    print('*' * i)