# Напишите программу, которая определяет наименьшее из двух чисел.

print(min(int(input()), int(input())))