# Напишите программу, которая определяет, является число чётным или нечётным.

if int(input()) % 2 == 0:
    print('Yes')
else:
    print('No')