# Напишите программу, которая определяет, разрешён ли пользователю доступ к интернет-ресурсу или нет.

if int(input()) >= 18:
    print('Yes')
else:
    print('No')